---
kind: method
id: M:Autodesk.Revit.DB.DetailCurveArray.Append(Autodesk.Revit.DB.DetailCurve)
source: html/b19f9fa5-f0f7-bda5-d641-6a3e7b5b6afc.htm
---
# Autodesk.Revit.DB.DetailCurveArray.Append Method

## Syntax (C#)
```csharp
public virtual void Append(
	DetailCurve item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.DetailCurve`)